import './App.css';

import React, {useState, createElement} from 'react';



let io = 0;
let val;

function App() {
  let response = "უკაცრავად ვერ გავიგე!";

  const [message, setMessage] = useState('');
  const handleChange = event => {
    setMessage(event.target.value);

    //console.log('value is:', event.target.value);
    val = event.target.value;
    
  };


  

  console.log(val)


  if (val === "hi" || val === "მოგესალმები" || val === "მოგესალმები!" || val === "გამარჯობა" || val === "გამარჯობა!" || val === "გამარჯობა." || val === "ბარო" || val === "ბარო." || val === "ბარო!" || val === " ბარო ბარო" || val === "ბარო, ბარო." || val === "გამარჯობათ" || val === "გამარჯობათ!" || val === "გამარჯობათ.") {
    
    let num = Math.floor(Math.random() * (4 - 1) + 1);
    console.log(num)
    

    if (num === 1) {
      response = "გამარჯობა!!!"
    }else if (num === 2) {
      response = "გამარჯობა! რა კითხვა გაქვს?"
    }else if (num === 3) {
      response = "გაგიმარჯოს!"
    }
    
  }else if (val === "როგორ ხარ" || val === "როგორ ხარ?" || val === "როგორხარ" || val === "როგორ ხარ." || val === "როგორ ბრძანდებით?" || val === "როგორ ბრძანდებით." || val === "როგორ ბრძანდებით" || val === "როგორ ბრძანდები?" || val === "როგორ ბრძანდები." || val === "როგორ ბრძანდები" || val === "როგორ ხარ" || val === "როგორ ხა?") {
    
    let num = Math.floor(Math.random() * (4 - 1) + 1);

    if (num === 1) {
      response = "მშვენიალურად! ისე როგორც სხვა ყველა ბედნიერი ჩატბოტი";
    }else if (num === 2) {
      response = "რავი ვარ"
    }else if (num === 3) {
      response = "კარგად"
    }
    
  }else if (val === "რა არის კიბერლექსიკონი" || val === "რა არის კიბერლექსიკონი?" || val === "კიბერლექსიკონი?" || val === "კიბერლექსიკონი" || val === "რა არის კიბერ ლექსიკონი" || val === "რა არის კიბერ ლექსიკონი?" || val === "კიბერ ლექსიკონი?" || val === "კიბერ ლექსიკონი") {
    response = `<p>კიბერ ლექსიკონი წარმოადგენს ცნობარს, რომელიც
    თანამედროვე კიბერტერმილონოგიის ათვისებაში
    დაეხმარება ჩვენი საზოგადოების არაერთ სეგმენტს.
    ციფრულ ეპოქაში საზოგადოების ამ მიმართულებით ცნობიერების
    ამაღლება ჩემი აზრით უმნიშვნელოვანესია.
    
    მე ვიყენებ კიბერლექსიკონს და შემიძლია განგიმარტოთ ინტერნეტთან 
    დაკავშირებული სიტყვები როგორიცაა "აპი" ან "ფიშინგი".</p>
    
    <p>ლექსიკონის ავტორი: მარიკა სიხარულიძე</p>
    <p>რედაქტორი: მაია ნაკაშიძე</p>
    `
  }else if (val === "რა არის აგრესორი" || val === "რა არის აგრესორი?" || val === "აგრესორი?" || val === "აგრესორი" || val === "აგრესორი." || val === "ვინ არის აგრესორი?" || val === "ვინ არის აგრესორი" || val === "აგრესორი არის ვინ?" || val === "აგრესორი არის ვინ" || val === "აგრესორი არის ვინ." || val === "რას ნიშნავს აგრესორი?" || val === "რას ნიშნავს აგრესორი." || val === "რას ნიშნავს აგრესორი" ||  val === "აგრესორის მნიშვნელობა." || val === "აგრესორის მნიშვნელობა" || val === "ვის ეწოდება აგრესორი" || val === "ვის ეწოდება აგრესორი?"){
    response = `აგრესორი არის პირი, რომელიც დევნის და არასწორად/
    უსამართლოდ ექცევა დაზარალებულს, უსწორდება
    მას ფიზიკურად, ან აყენებს ფსიქოლოგიურ ზიანს.`
  }else if (val === "რა არის აპლიკაცია" || val === "რა არის აპლიკაცია?" || val === "აპლიკაცია?" || val === "აპლიკაცია" || val === "აპლიკაცია." || val === "რას ნიშნავს აპლიკაცია?" || val === "რას ნიშნავს ააპლიკაცია." || val === "რას ნიშნავს აპლიკაცია" ||  val === "აპლიკაციის მნიშვნელობა." || val === "აპლიკაციის მნიშვნელობა" || val === "რას ეწოდება აპლიკაცია" || val === "რას ეწოდება აპლიკაცია?"){
    response = `აპლიკაცია წარმოადგენს 
    ჩამოსატვირთ კომპიუტერულ პროგრამას, რომელიც 
    განკუთვნილია კომპიუტერების, სმარტფონების, 
    ტაბლეტების ან სხვა მოწყობილობებისთვის.`
  }else if (val === "რა არის აპი" || val === "რა არის აპი?" || val === "აპი?" || val === "აპი" || val === "აპი." || val === "რა არის აპი?" || val === "რა არის აპი" || val === "აპი არის რა?" || val === "აპი არის რა" || val === "აპი არის რა." || val === "რას ნიშნავს აპი?" || val === "რას ნიშნავს აპი." || val === "რას ნიშნავს აპი" ||  val === "აპის მნიშვნელობა." || val === "აპის მნიშვნელობა" || val === "რას ეწოდება აპი" || val === "რას ეწოდება აპი?"){
    response = `აპი წარმოადგენს ჩამოსატვირთ
    კომპიუტერულ პროგრამას, რომელიც განკუთვნილია
    კომპიუტერების, სმარტფონების, ტაბლეტების
    ან სხვა მოწყობილობებისთვის.`
  }else if (val === "რა არის ახალბედა" || val === "რა არის ახალბედა?" || val === "ახალბედა?" || val === "ახალბედა" || val === "ახალბედა." || val === "ვინ არის ახალბედა?" || val === "ვინ არის ახალბედა" || val === "ახალბედა არის ვინ?" || val === "ახალბედა არის ვინ" || val === "ახალბედა არის ვინ." || val === "რას ნიშნავს ახალბედა?" || val === "რას ნიშნავს ახალბედა." || val === "რას ნიშნავს ახალბედა" ||  val === "ახალბედა მნიშვნელობა." || val === "ახალბედა მნიშვნელობა" || val === "ვის ეწოდება აგახალბედა" || val === "ვის ეწოდება ახალბედა?"){
    response = `ახალბედა არის მომხმარებელი, რომელსაც
    ნაკლები გამოცდილება აქვს კონკრეტულ ციფრულ
    ან ვირტუალურ სივრცეში.`
  }else if (val === "რა არის ბაისტენდერი" || val === "რა არის ბაისტენდერი?" || val === "ბაისტენდერი?" || val === "ბაისტენდერი" || val === "ბაისტენდერი." || val === "ვინ არის ბაისტენდერი?" || val === "ვინ არის ბაისტენდერი" || val === "ბაისტენდერი არის ვინ?" || val === "ბაისტენდერი არის ვინ" || val === "ბაისტენდერი არის ვინ." || val === "რას ნიშნავს ბაისტენდერი?" || val === "რას ნიშნავს ბაისტენდერი." || val === "რას ნიშნავს ბაისტენდერი" ||  val === "ბაისტენდერი მნიშვნელობა." || val === "ბაისტენდერი მნიშვნელობა" || val === "ვის ეწოდება ბაისტენდერი" || val === "ვის ეწოდება ბაისტენდერი?"){
    response = `ბაისტენდერი არის პიროვნება, რომელიც სკოლაში, ონლაინ 
    სივრცეში, ან სხვა ადგილას დევნის მომსწრე ან
    მოწმე. ეს შეიძლება იყოს დაზარალებულის ან აგრესორის
     მეგობარი, თანაკლასელი, პედაგოგი ან
    სხვა პირი. ბაისტენდერი მომსწრეა დაშინების ფაქტის,
     რომელიც მოხდა სკოლის შიგნით, გარეთ ან
    ონლაინსივრცეში.`
  }else if (val === "რა არის ბლოგერი" || val === "რა არის ბლოგერი?" || val === "ბლოგერი?" || val === "ბლოგერი" || val === "ბლოგერი." || val === "ვინ არის ბლოგერი?" || val === "ვინ არის ბლოგერი" || val === "ბლოგერი არის ვინ?" || val === "ბლოგერი არის ვინ" || val === "ბლოგერი არის ვინ." || val === "რას ნიშნავს ბლოგერი?" || val === "რას ნიშნავს ბლოგერი." || val === "რას ნიშნავს ბლოგერი" ||  val === "ბლოგერი მნიშვნელობა." || val === "ბლოგერი მნიშვნელობა" || val === "ვის ეწოდება ბლოგერი" || val === "ვის ეწოდება ბლოგერი?"){
    response = `ბლოგერი არის ნებისმიერი პირი, რომელიც დაკავებულია
    ბლოგის შექმნა-გამოქვეყნებით. იმ შემთხვევაში,
    თუ ბლოგერი კითხვადია და დიდი რაოდენობით
    გამომწერი ჰყავს, მას ეწოდება „ინფლუენსერი“.`
  }else if (val === "რა არის ბლოგერობა" || val === "რა არის ბლოგერობა?" || val === "ბლოგერობა?" || val === "ბლოგერობა" || val === "რა არის ბლოგერობა?" || val === "რა არის ბლოგერობა" || val === "ბლოგერობა არის ვინ?" || val === "ბლოგერობა არის ვინ" || val === "ბლოგერობა არის ვინ." || val === "რას ნიშნავს ბლოგერობა?" || val === "რას ნიშნავს ბლოგერობა." || val === "რას ნიშნავს ბლოგერობა" ||  val === "ბლოგერობის მნიშვნელობა." || val === "ბლოგერობის მნიშვნელობა" || val === "რას ეწოდება ბლოგერობა" || val === "რას ეწოდება ბლოგერი?"){
    response = `ბლოგერობა ნიშნავს ბლოგის წერას
    და მართვას`
  }else if (val === "რა არის ბლოგი" || val === "რა არის ბლოგი?" || val === "ბლოგი?" || val === "ბლოგი" || val === "ბლოგი." || val === "რა არის ბლოგი?" || val === "რა არის ბლოგი" || val === "ბლოგი არის რა?" || val === "ბლოგი არის რა" || val === "ბლოგი არის რა." || val === "რას ნიშნავს ბლოგი?" || val === "რას ნიშნავს ბლოგი." || val === "რას ნიშნავს ბლოგი" ||  val === "ბლოგის მნიშვნელობა." || val === "ბლოგის მნიშვნელობა" || val === "რას ეწოდება ბლოგი" || val === "რას ეწოდება ბლოგი?"){
    response = `ბლოგი არის რეგულარულად განახლებადი
     ვებჟურნალი, რომელიც მოიცავს ინფორმაციას
    სამიზნე მკითხველისთვის გარკვეული თემატიკის
    ირგვლივ. ციფრულ ჟურნალში ბლოგერი
    მოუთხრობს მკითხველს თავისი გამოცდილების,
    გრძნობების, მისწრაფებების, ან განზრახვების
    შესახებ.`
  }else if (val === "რა არის ბოტი" || val === "რა არის ბოტი?" || val === "ბოტი?" || val === "ბოტი" || val === "ბოტი." || val === "რა არის ბოტი?" || val === "რა არის ბოტი" || val === "ბოტი არის რა?" || val === "ბოტი არის რა" || val === "ბოტი არის რა." || val === "რას ნიშნავს ბოტი?" || val === "რას ნიშნავს ბოტი." || val === "რას ნიშნავს ბოტი" ||  val === "ბოტის მნიშვნელობა." || val === "ბოტის მნიშვნელობა" || val === "რას ეწოდება ბოტი" || val === "რას ეწოდება ბოტი?"){
    response = `ბოტი არის ავტონომიური
    კომპიუტერული პროგრამა, რომელიც ადამიანის
    თვისებების იმიტაციას აკეთებს; იგი იყენებს ინსტრუმენტებს,
    რომელიც გასცემს ავტომატურ პასუხებს
    სტანდარტიზებული და განმეორებითი ფორმით.
    ბოტის გამოყენება ძირითადად ხდება ონლაინრეჟიმში 
    კითხვებზე საპასუხოდ.`
  }else if (val === "რა არის ბული" || val === "რა არის ბული?" || val === "ბული?" || val === "ბული" || val === "ბული." || val === "ვინ არის ბული?" || val === "ვინ არის ბული" || val === "ბული არის ვინ?" || val === "ბული არის ვინ" || val === "ბული არის ვინ." || val === "რას ნიშნავს ბული?" || val === "რას ნიშნავს ბული." || val === "რას ნიშნავს ბული" ||  val === "ბულის მნიშვნელობა." || val === "ბულის მნიშვნელობა" || val === "ვის ეწოდება ბული" || val === "ვის ეწოდება ბული?"){
    response = `პირი, რომელიც ახორციელებს ბულინგს,
    დაშინებას ან დამცირებას..`
  }else if (val === "რა არის ბულინგი" || val === "რა არის ბულინგი?" || val === "ბულინგი?" || val === "ბულინგი" || val === "ბულინგი." || val === "რა არის ბულინგი?" || val === "რა არის ბულინგი" || val === "ბულინგი არის რა?" || val === "ბულინგი არის რა" || val === "ბულინგი არის რა." || val === "რას ნიშნავს ბულინგი?" || val === "რას ნიშნავს ბულინგი." || val === "რას ნიშნავს ბულინგი" ||  val === "ბულინგის მნიშვნელობა." || val === "ბულინგის მნიშვნელობა" || val === "რას ეწოდება ბულინგი" || val === "რას ეწოდება ბულინგი?"){
    response = `<p>მტრული და დამამცირებელი
    მოპყრობა, რომელსაც ერთი ადამიანი ან ადამიანთა 
    ჯგუფი ახორციელებს მეორე ადამიანზე ან
    ადამიანთა ჯგუფზე; შეიძლება იყოს როგორც სექსუალური 
    ხასიათის, ასევე მორალური, ფიზიკური
    ან სხვა ტიპის ზეწოლა.</p>`
  }else if (val === "რა არის გამოძალვა" || val === "რა არის გამოძალვა?" || val === "გამოძალვა?" || val === "გამოძალვა" || val === "გამოძალვა." || val === "რა არის გამოძალვა?" || val === "რა არის გამოძალვა" || val === "გამოძალვა არის რა?" || val === "გამოძალვა არის რა" || val === "გამოძალვა არის რა." || val === "რას ნიშნავს გამოძალვა?" || val === "რას ნიშნავს გამოძალვა." || val === "რას ნიშნავს გამოძალვა" ||  val === "გამოძალვის მნიშვნელობა." || val === "გამოძალვის მნიშვნელობა" || val === "რას ეწოდება გამოძალვა" || val === "რას ეწოდება გამოძალვა?"){
    response = `გამოძალვა არის ალადობრივი ქცევა, ზეწოლა
    ან დაშინება, რომლის მეშვეობითაც მსხვერ-
    პლი იძულებულია განახორციელოს ისეთი ქმედე-
    ბები, რომელიც მას ან სხვას ზიანს მიაყენებს`
  }else if (val === "რა არის განახლება" || val === "რა არის განახლება?" || val === "განახლება?" || val === "განახლება" || val === "განახლება." || val === "რა არის განახლება?" || val === "რა არის განახლება" || val === "განახლება არის რა?" || val === "განახლება არის რა" || val === "განახლება არის რა." || val === "რას ნიშნავს განახლება?" || val === "რას ნიშნავს განახლება." || val === "რას ნიშნავს განახლება" ||  val === "განახლების მნიშვნელობა." || val === "განახლების მნიშვნელობა" || val === "რას ეწოდება განახლება" || val === "რას ეწოდება განახლება?"){
    response = `ხარვეზების გამოსწორება
    ოპერაციულ სისტემაში მწყობრიდან გამოსული ან
    მოძველებული ვერსიების დასახვეწად.`
  }else if (val === "რა არის გეიმერი" || val === "რა არის გეიმერი?" || val === "გეიმერი?" || val === "გეიმერი" || val === "გეიმერი." || val === "ვინ არის გეიმერი?" || val === "ვინ არის გეიმერი" || val === "გეიმერი არის ვინ?" || val === "გეიმერი არის ვინ" || val === "გეიმერი არის ვინ." || val === "რას ნიშნავს გეიმერი?" || val === "რას ნიშნავს გეიმერი." || val === "რას ნიშნავს გეიმერი" ||  val === "გეიმერის მნიშვნელობა." || val === "გეიმერის მნიშვნელობა" || val === "ვის ეწოდება გეიმერი" || val === "ვის ეწოდება გეიმერი?"){
    response = `გეიმერი არის პირი, რომელიც დროს ატარებს
    ვიდეოთამაშების სამყაროში და მეტწილად მონაწილეობს
    ქსელურ თამაშებში; განვითარებული აქვს
    მისიების დასახურად განკუთვნილი უნარ-ჩვევები,
    ერკვევა მათი შესრულების თავისებურებებსა და
    ხრიკებში; ხშირად აღნიშნული სფეროს ექსპერტია.`
  }else if (val === "რა არის გეოლოკაცია" || val === "რა არის გეოლოკაცია?" || val === "გეოლოკაცია?" || val === "გეოლოკაცია" || val === "გეოლოკაცია." || val === "რა არის გეოლოკაცია?" || val === "რა არის გეოლოკაცია" || val === "გეოლოკაცია არის რა?" || val === "გეოლოკაცია არის რა" || val === "გეოლოკაცია არის რა." || val === "რას ნიშნავს გეოლოკაცია?" || val === "რას ნიშნავს გეოლოკაცია." || val === "რას ნიშნავს გეოლოკაცია" ||  val === "გეოლოკაციის მნიშვნელობა." || val === "გეოლოკაციის მნიშვნელობა" || val === "რას ეწოდება გეოლოკაცია" || val === "რას ეწოდება გეოლოკაცია?"){
    response = `ობიექტის გეოგრა-
    ფიული ადგილმდებარეობის დასადგენად განკუთვნილი,
    ინტერნეტთან დაკავშირებული ხელსაწყო.`
  }else if (val === "რა არის გრუმინგი" || val === "რა არის გრუმინგი?" || val === "გრუმინგი?" || val === "გრუმინგი" || val === "გრუმინგი." || val === "რა არის გრუმინგი?" || val === "რა არის გრუმინგი" || val === "გრუმინგი არის რა?" || val === "გრუმინგი არის რა" || val === "გრუმინგი არის რა." || val === "რას ნიშნავს გრუმინგი?" || val === "რას ნიშნავს გრუმინგი." || val === "რას ნიშნავს გრუმინგი" ||  val === "გრუმინგის მნიშვნელობა." || val === "გრუმინგის მნიშვნელობა" || val === "რას ეწოდება გრუმინგი" || val === "რას ეწოდება გრუმინგი?"){
    response = `გრუმინგი არის მოზარდის ან არასრულწ-
    ლოვნის დაყოლიება სექსუალურ ქმედებაზე ინტერნეტის მეშვეობით.`
  }else if (val === "რა არის გუგლი" || val === "რა არის გუგლი?" || val === "გუგლი?" || val === "გუგლი" || val === "გუგლი." || val === "რა არის გუგლი?" || val === "რა არის გუგლი" || val === "გუგლი არის რა?" || val === "გუგლი არის რა" || val === "გუგლი არის რა." || val === "რას ნიშნავს გუგლი?" || val === "რას ნიშნავს გუგლი." || val === "რას ნიშნავს გუგლი" ||  val === "გუგლის მნიშვნელობა." || val === "გუგლის მნიშვნელობა" || val === "რას ეწოდება გუგლი" || val === "რას ეწოდება გუგლი?"){
    response = `<a href="https://www.google.com">გუგლი</a> არისპოპულარული ინტერ-
    ნეტსაძიებო სისტემა.`
  }else if (val === "რა არის დაბლოკვა" || val === "რა არის დაბლოკვა?" || val === "დაბლოკვა?" || val === "დაბლოკვა" || val === "დაბლოკვა." || val === "რა არის დაბლოკვა?" || val === "რა არის დაბლოკვა" || val === "დაბლოკვა არის რა?" || val === "დაბლოკვა არის რა" || val === "დაბლოკვა არის რა." || val === "რას ნიშნავს დაბლოკვა?" || val === "რას ნიშნავს დაბლოკვა." || val === "რას ნიშნავს დაბლოკვა" ||  val === "დაბლოკვის მნიშვნელობა." || val === "დაბლოკვის მნიშვნელობა" || val === "რას ეწოდება დაბლოკვა" || val === "რას ეწოდება დაბლოკვა?"){
    response = `გარკვეულ ინფორმაციაზე, ელექტრონულ
    ფოსტაზე, ან სოციალურ ქსელზე წვდომის შეზღუდვა.`
  }else if (val === "რა არის ტროლინგი" || val === "რა არის ტროლინგი?" || val === "ტროლინგი?" || val === "ტროლინგი" || val === "ტროლინგი." || val === "რა არის ტროლინგი?" || val === "რა არის ტროლინგი" || val === "ტროლინგი არის რა?" || val === "ტროლინგი არის რა" || val === "ტროლინგი არის რა." || val === "რას ნიშნავს ტროლინგი?" || val === "რას ნიშნავს ტროლინგი." || val === "რას ნიშნავს ტროლინგი" ||  val === "ტროლინგის მნიშვნელობა." || val === "ტროლინგის მნიშვნელობა" || val === "რას ეწოდება ტროლინგი" || val === "რას ეწოდება ტროლინგი?"){
    response = `მომხმარებელთა
    მაპროვოცირებელი ან დამცინავი კომენტარების
    გამოქვეყნება სოციალურ ქსელში.`
  }else if (val === "რა არის დატროლვა" || val === "რა არის დატროლვა?" || val === "დატროლვა?" || val === "დატროლვა" || val === "დატროლვა." || val === "რა არის დატროლვა?" || val === "რა არის დატროლვა" || val === "დატროლვა არის რა?" || val === "დატროლვა არის რა" || val === "დატროლვა არის რა." || val === "რას ნიშნავს დატროლვა?" || val === "რას ნიშნავს დატროლვა." || val === "რას ნიშნავს დატროლვა" ||  val === "დატროლვის მნიშვნელობა." || val === "დატროლვის მნიშვნელობა" || val === "რას ეწოდება დატროლვა" || val === "რას ეწოდება დატროლვა?"){
    response = `მომხმარებელთა
    მაპროვოცირებელი ან დამცინავი კომენტარების
    გამოქვეყნება სოციალურ ქსელში.`
  }else if (val === "რა არის დაშიფრვა" || val === "რა არის დაშიფრვა?" || val === "დაშიფრვა?" || val === "დაშიფრვა" || val === "დაშიფრვა." || val === "რა არის დაშიფრვა?" || val === "რა არის დაშიფრვა" || val === "დაშიფრვა არის რა?" || val === "დაშიფრვა არის რა" || val === "დაშიფრვა არის რა." || val === "რას ნიშნავს დაშიფრვა?" || val === "რას ნიშნავს დაშიფრვა." || val === "რას ნიშნავს დაშიფრვა" ||  val === "დაშიფრვის მნიშვნელობა." || val === "დაშიფრვის მნიშვნელობა" || val === "რას ეწოდება დაშიფრვა" || val === "რას ეწოდება დაშიფრვა?"){
    response = `დაშიფრვა არის ინფორმაციის დაშიფრვა,
    რომელიც იცავს შინაარსს/ტექსტს არაავტორიზებული
    წვდომისაგან გასაღების და/ან ალგორითმის
    მეშვეობით.`
  }else if (val === "რა არის ჰაკირება" || val === "რა არის ჰაკირება?" || val === "ჰაკირება?" || val === "ჰაკირება" || val === "ჰაკირება." || val === "რა არის ჰაკირება?" || val === "რა არის ჰაკირება" || val === "ჰაკირება არის რა?" || val === "ჰაკირება არის რა" || val === "ჰაკირება არის რა." || val === "რას ნიშნავს ჰაკირება?" || val === "რას ნიშნავს ჰაკირება." || val === "რას ნიშნავს ჰაკირება" ||  val === "ჰაკირების მნიშვნელობა." || val === "ჰაკირების მნიშვნელობა" || val === "რას ეწოდება ჰაკირება" || val === "რას ეწოდება ჰაკირება?"){
    response = `არასამართლებრივი
    წვდომა/შესვლა კომპიუტერულ სისტემაში,
    ანუ ე.წ. კომპიუტერული დამცავი სისტემის გატეხვა.
    ტერმინი დაჰაკვა ან ჰაკირება აგრეთვე ვრცელდება
    იმ ადამიანზე, რომელიც არასამართლებრივი,
    უკანონო გზით ახდენს პროგრამის, ციფრული
    აუდიო და ვიდეომასალის ან სხვა პროდუქციის
    კოპირებას.`
  }else if (val === "რა არის დაჰაკვა" || val === "რა არის დაჰაკვა?" || val === "დაჰაკვა?" || val === "დაჰაკვა" || val === "დაჰაკვა." || val === "რა არის დაჰაკვა?" || val === "რა არის დაჰაკვა" || val === "დაჰაკვა არის რა?" || val === "დაჰაკვა არის რა" || val === "დაჰაკვა არის რა." || val === "რას ნიშნავს დაჰაკვა?" || val === "რას ნიშნავს დაჰაკვა." || val === "რას ნიშნავს დაჰაკვა" ||  val === "დაჰაკვის მნიშვნელობა." || val === "დაჰაკვის მნიშვნელობა" || val === "რას ეწოდება დაჰაკვა" || val === "რას ეწოდება დაჰაკვა?"){
    response = `არასამართლებრივი
    წვდომა/შესვლა კომპიუტერულ სისტემაში,
    ანუ ე.წ. კომპიუტერული დამცავი სისტემის გატეხვა.
    ტერმინი დაჰაკვა ან ჰაკირება აგრეთვე ვრცელდება
    იმ ადამიანზე, რომელიც არასამართლებრივი,
    უკანონო გზით ახდენს პროგრამის, ციფრული
    აუდიო და ვიდეომასალის ან სხვა პროდუქციის
    კოპირებას.`
  }else if (val === "რა არის დეშიფრაცია" || val === "რა არის დეშიფრაცია?" || val === "დეშიფრაცია?" || val === "დეშიფრაცია" || val === "დეშიფრაცია." || val === "რა არის დეშიფრაცია?" || val === "რა არის დეშიფრაცია" || val === "დეშიფრაცია არის რა?" || val === "დეშიფრაცია არის რა" || val === "დეშიფრაცია არის რა." || val === "რას ნიშნავს დეშიფრაცია?" || val === "რას ნიშნავს დეშიფრაცია." || val === "რას ნიშნავს დეშიფრაცია" ||  val === "დეშიფრაცის მნიშვნელობა." || val === "დეშიფრაცის მნიშვნელობა" || val === "რას ეწოდება დეშიფრაცია" || val === "რას ეწოდება დეშიფრაცია?"){
    response = `დაშიფრული ტექსტის
    თავდაპირველ მდგომარეობაში გადაყვანის პროცესი.`
  }else if (val === "რა არის დიალოგის ისტორია" || val === "რა არის დიალოგის ისტორია?" || val === "დიალოგის ისტორია?" || val === "დიალოგის ისტორია" || val === "დიალოგის ისტორია." || val === "რა არის დიალოგის ისტორია?" || val === "რა არის დიალოგის ისტორია" || val === "დიალოგის ისტორია არის რა?" || val === "დიალოგის ისტორია არის რა" || val === "დიალოგის ისტორია არის რა." || val === "რას ნიშნავს დიალოგის ისტორია?" || val === "რას ნიშნავს დიალოგის ისტორია." || val === "რას ნიშნავს დიალოგის ისტორია" ||  val === "დიალოგის ისტორიის მნიშვნელობა." || val === "დიალოგის ისტორიის მნიშვნელობა" || val === "რას ეწოდება დიალოგის ისტორია" || val === "რას ეწოდება დიალოგის ისტორია?"){
    response = `მომხმარებელთა 
    ვირტუალური დიალოგისა ან მიმოწერის ისტორია
    ვებგვერდზე, ჩატში, სოციალურ ქსელში, ან
    ელექტრონულ ფოსტაზე.`
  }else if (val === "რა არის ისტორია" || val === "რა არის ისტორია?" || val === "ისტორია?" || val === "ისტორია" || val === "ისტორია." || val === "რა არის ისტორია?" || val === "რა არის ისტორია" || val === "ისტორია არის რა?" || val === "ისტორია არის რა" || val === "ისტორია არის რა." || val === "რას ნიშნავს ისტორია?" || val === "რას ნიშნავს ისტორია." || val === "რას ნიშნავს ისტორია" ||  val === "ისტორიის მნიშვნელობა." || val === "ისტორიის მნიშვნელობა" || val === "რას ეწოდება ისტორია" || val === "რას ეწოდება ისტორია?"){
    response = `მომხმარებელთა
    ვირტუალური დიალოგისა ან მიმოწერის ისტორია
    ვებგვერდზე, ჩატში, სოციალურ ქსელში, ან
    ელექტრონულ ფოსტაზე.`
  }else if (val === "რა არის დომენი" || val === "რა არის დომენი?" || val === "დომენი?" || val === "დომენი" || val === "დომენი." || val === "რა არის დომენი?" || val === "რა არის დომენი" || val === "დომენი არის რა?" || val === "დომენი არის რა" || val === "დომენი არის რა." || val === "რას ნიშნავს დომენი?" || val === "რას ნიშნავს დომენი." || val === "რას ნიშნავს დომენი" ||  val === "დომენის მნიშვნელობა." || val === "დომენის მნიშვნელობა" || val === "რას ეწოდება დომენი" || val === "რას ეწოდება დომენი?"){
    response = `ქსელის იდენტიფიცირებისთვის
    განკუთვნილი უნიკალური სახელწოდება ან იარლიყი;
    დომენის სახელები წარმოქმნილია დომენის
    სახელების სისტემის წესებისა და პროცედურების
    შესაბამისად.`
  }else if (val === "რა არის დომენის მიტაცება" || val === "რა არის დომენის მიტაცება?" || val === "დომენის მიტაცება?" || val === "დომენის მიტაცება" || val === "დომენის მიტაცება." || val === "რა არის დომენის მიტაცება?" || val === "რა არის დომენის მიტაცება" || val === "დომენის მიტაცება არის რა?" || val === "დომენის მიტაცება არის რა" || val === "დომენის მიტაცება არის რა." || val === "რას ნიშნავს დომენის მიტაცება?" || val === "რას ნიშნავს დომენის მიტაცება." || val === "რას ნიშნავს დომენის მიტაცება" ||  val === "დომენის მიტაცების მნიშვნელობა." || val === "დომენის მიტაცების მნიშვნელობა" || val === "რას ეწოდება დომენის მიტაცება" || val === "რას ეწოდება დომენის მიტაცება?"){
    response = `არასანქცირებული წვდომა დომენის
    კონფიგურაციაზე ინტერნეტში, რომლის მეშვე-
    ობითაც ხდება სხვადასხვა ავთენტურ გვერდებზე
    გადამისამართება.`
  }else if (val === "რა არის დოქსინგი" || val === "რა არის დოქსინგი?" || val === "დოქსინგი?" || val === "დოქსინგი" || val === "დოქსინგი." || val === "რა არის დოქსინგი?" || val === "რა არის დოქსინგი" || val === "დოქსინგი არის რა?" || val === "დოქსინგი არის რა" || val === "დოქსინგი არის რა." || val === "რას ნიშნავს დოქსინგი?" || val === "რას ნიშნავს დოქსინგი." || val === "რას ნიშნავს დოქსინგი" ||  val === "დოქსინგის მნიშვნელობა." || val === "დოქსინგის მნიშვნელობა" || val === "რას ეწოდება დოქსინგი" || val === "რას ეწოდება დოქსინგი?"){
    response = `პირადი მონაცემების, ან 
    საიდენტიფიკაციო ინფორმაციის გამოქვეყნება 
    კონკრეტული ფიზიკური პირის შესახებ ინტერნეტში, 
    როგორც წესი, უარყოფითი განზრახვით.`
  }else if (val === "რა არის ემოციური ძალადობა" || val === "რა არის ემოციური ძალადობა?" || val === "ემოციური ძალადობა?" || val === "ემოციური ძალადობა" || val === "ემოციური ძალადობა." || val === "რა არის ემოციური ძალადობა?" || val === "რა არის ემოციური ძალადობა" || val === "ემოციური ძალადობა არის რა?" || val === "ემოციური ძალადობა არის რა" || val === "ემოციური ძალადობა არის რა." || val === "რას ნიშნავს ემოციური ძალადობა?" || val === "რას ნიშნავს ემოციური ძალადობა." || val === "რას ნიშნავს ემოციური ძალადობა" ||  val === "ემოციური ძალადობის მნიშვნელობა." || val === "ემოციური ძალადობის მნიშვნელობა" || val === "რას ეწოდება ემოციური ძალადობა" || val === "რას ეწოდება ემოციური ძალადობა?"){
    response = `პირის ან ადამიანთა ჯგუფის
    სიტყვიერი შეურაცხყოფა, დამცირება, სოციალური
    მიუღებლობა, კრიტიკა ან დისკვალიფიკაცია.`
  }else if (val === "რა არის ემოჯი" || val === "რა არის ემოჯი?" || val === "ემოჯი?" || val === "ემოჯი" || val === "ემოჯი." || val === "რა არის ემოჯი?" || val === "რა არის ემოჯი" || val === "ემოჯი არის რა?" || val === "ემოჯი არის რა" || val === "ემოჯი არის რა." || val === "რას ნიშნავს ემოჯი?" || val === "რას ნიშნავს ემოჯი." || val === "რას ნიშნავს ემოჯი" ||  val === "ემოჯის მნიშვნელობა." || val === "ემოჯის მნიშვნელობა" || val === "რას ეწოდება ემოჯი" || val === "რას ეწოდება ემოჯი?"){
    response = `ემოციების გამოსახულება, რომელიც
    გამოიხატება ასოთა კომბინაციით, რიცხვებით,
    სიმბოლოებით, ან ნიშნებით და გამოხატავს
    გრძნობებსა და/ან ემოციურ მდგომარეობას.`
  }else if (val === "რა არის ვირუსული გავრცელება" || val === "რა არის ვირუსული გავრცელება?" || val === "ვირუსული გავრცელება?" || val === "ვირუსული გავრცელება" || val === "ვირუსული გავრცელება." || val === "რა არის ვირუსული გავრცელება?" || val === "რა არის ვირუსული გავრცელება" || val === "ვირუსული გავრცელება არის რა?" || val === "ვირუსული გავრცელება არის რა" || val === "ვირუსული გავრცელება არის რა." || val === "რას ნიშნავს ვირუსული გავრცელება?" || val === "რას ნიშნავს ვირუსული გავრცელება." || val === "რას ნიშნავს ვირუსული გავრცელება" ||  val === "ვირუსული გავრცელების მნიშვნელობა." || val === "ვირუსული გავრცელების მნიშვნელობა" || val === "რას ეწოდება ვირუსული გავრცელება" || val === "რას ეწოდება ვირუსული გავრცელება?"){
    response = `ახალი ამბის
    ან ინფორმაციის სწრაფი პროპაგანდა ან გავრცელება,
    რაც ქმნის მაღალი დონის საკომუნიკაციო
    გავლენას.`
  }else if (val === "რა არის თითის ანაბეჭდი" || val === "რა არის თითის ანაბეჭდი?" || val === "თითის ანაბეჭდი?" || val === "თითის ანაბეჭდი" || val === "თითის ანაბეჭდი." || val === "რა არის თითის ანაბეჭდი?" || val === "რა არის თითის ანაბეჭდი" || val === "თითის ანაბეჭდი არის რა?" || val === "თითის ანაბეჭდი არის რა" || val === "თითის ანაბეჭდი არის რა." || val === "რას ნიშნავს თითის ანაბეჭდი?" || val === "რას ნიშნავს თითის ანაბეჭდი." || val === "რას ნიშნავს თითის ანაბეჭდი" ||  val === "თითის ანაბეჭდის მნიშვნელობა." || val === "თითის ანაბეჭდის მნიშვნელობა" || val === "რას ეწოდება თითის ანაბეჭდი" || val === "რას ეწოდება თითის ანაბეჭდი?"){
    response = `თითოეული მომხმარებლის მიერ 
    ინტერნეტის საძიებო სისტემაში დატოვებული კვალი.`
  }else if (val === "რა არის იმეილი" || val === "რა არის იმეილი?" || val === "იმეილი?" || val === "იმეილი" || val === "იმეილი." || val === "რა არის იმეილი?" || val === "რა არის იმეილი" || val === "იმეილი არის რა?" || val === "იმეილი არის რა" || val === "იმეილი არის რა." || val === "რას ნიშნავს იმეილი?" || val === "რას ნიშნავს იმეილი." || val === "რას ნიშნავს იმეილი" ||  val === "იმეილის მნიშვნელობა." || val === "იმეილის მნიშვნელობა" || val === "რას ეწოდება იმეილი" || val === "რას ეწოდება იმეილი?"){
    response = `ელექტრონული საშუალებებით გაგზავნილი შეტყობინება,
    რომელიც ვრცელდება ინტერნეტის საშუალებით.`
  }else if (val === "რა არის ინსტაგრამი" || val === "რა არის ინსტაგრამი?" || val === "ინსტაგრამი?" || val === "ინსტაგრამი" || val === "ინსტაგრამი." || val === "რა არის ინსტაგრამი?" || val === "რა არის ინსტაგრამი" || val === "ინსტაგრამი არის რა?" || val === "ინსტაგრამი არის რა" || val === "ინსტაგრამი არის რა." || val === "რას ნიშნავს ინსტაგრამი?" || val === "რას ნიშნავს ინსტაგრამი." || val === "რას ნიშნავს ინსტაგრამი" ||  val === "ინსტაგრამის მნიშვნელობა." || val === "ინსტაგრამის მნიშვნელობა" || val === "რას ეწოდება ინსტაგრამი" || val === "რას ეწოდება ინსტაგრამი?"){
    response = `სოციალური ქსელი,
    რომელიც შექმნილია ვიდეოების ან ფოტოების
    გასაზიარებლად. ინსტაგრამი იყენებს სხვადასხვა
    ეფექტებს, როგორიცაა ფილტრები, ჩარჩოები, 
    ფერები და სხვა.`
  }else if (val === "რა არის ინფლუენსერი" || val === "რა არის ინფლუენსერი?" || val === "ინფლუენსერი?" || val === "ინფლუენსერი" || val === "ინფლუენსერი." || val === "ვინ არის ინფლუენსერი?" || val === "ვინ არის ინფლუენსერი" || val === "ინფლუენსერი არის ვინ?" || val === "ინფლუენსერი არის ვინ" || val === "ინფლუენსერი არის ვინ." || val === "რას ნიშნავს ინფლუენსერი?" || val === "რას ნიშნავს ინფლუენსერი." || val === "რას ნიშნავს ინფლუენსერი" ||  val === "ინფლუენსერის მნიშვნელობა." || val === "ინფლუენსერის მნიშვნელობა" || val === "ვის ეწოდება ინფლუენსერი" || val === "ვის ეწოდება ინფლუენსერი?"){
    response = `ინფლუენსერი არის სოციალურ ქსელებში, ბლოგებსა და
    ფორუმებზე ცნობილი ინტერნეტმომხმარებელი,
    რომელსაც ბევრი გამომწერი ან მიმდევარი ჰყავს;
    ტრენდად აქცევს კონკრეტულ თემებს ან ინტერესებს
    ან, ზოგადად, პოპულარული და გაზიარებადია.`
  }else if (val === "რა არის ისტ" || val === "რა არის ისტ?" || val === "ისტ?" || val === "ისტ" || val === "ისტ." || val === "რა არის ისტ?" || val === "რა არის ისტ" || val === "ისტ არის რა?" || val === "ისტ არის რა" || val === "ისტ არის რა." || val === "რას ნიშნავს ისტ?" || val === "რას ნიშნავს ისტ." || val === "რას ნიშნავს ისტ" || val === "ისტ მნიშვნელობა." || val === "ისტ მნიშვნელობა" || val === "ისტს მნიშვნელობა." || val === "ისტს მნიშვნელობა" || val === "რას ეწოდება ისტ" || val === "რას ეწოდება ისტ?"){
    response = `ისტ არის ინფორმაციული და საკომუნიკაციო 
    ტექნოლოგიების აკრონიმი.`
  }else if (val === "რა არის იუთუბერი" || val === "რა არის იუთუბერი?" || val === "იუთუბერი?" || val === "იუთუბერი" || val === "იუთუბერი." || val === "ვინ არის იუთუბერი?" || val === "ვინ არის იუთუბერი" || val === "იუთუბერი არის ვინ?" || val === "იუთუბერი არის ვინ" || val === "იუთუბერი არის ვინ." || val === "რას ნიშნავს იუთუბერი?" || val === "რას ნიშნავს იუთუბერი." || val === "რას ნიშნავს იუთუბერი" ||  val === "იუთუბერის მნიშვნელობა." || val === "იუთუბერის მნიშვნელობა" || val === "ვის ეწოდება იუთუბერი" || val === "ვის ეწოდება იუთუბერი?"){
    response = `იუთუბერი მომხმარებლები, რომლებიც 
    იწერენ და ტვირთავენ ვიდეოებს იუთუბზე.
    მათი პოპულარობა დამოკიდებულია 
    გავრცელებული ვიდეოების ნახვების რაოდენობაზე.`
  }else if (val === "რა არის კიბერბულინგი" || val === "რა არის კიბერბულინგი?" || val === "კიბერბულინგი?" || val === "კიბერბულინგი" || val === "კიბერბულინგი." || val === "რა არის კიბერბულინგი?" || val === "რა არის კიბერბულინგი" || val === "კიბერბულინგი არის რა?" || val === "კიბერბულინგი არის რა" || val === "კიბერბულინგი არის რა." || val === "კიბერბულინგი ნიშნავს ისტ?" || val === "კიბერბულინგი ნიშნავს ისტ." || val === "კიბერბულინგი ნიშნავს ისტ" || val === "კიბერბულინგი მნიშვნელობა." || val === "კიბერბულინგი მნიშვნელობა" || val === "კიბერბულინგის მნიშვნელობა." || val === "კიბერბულინგის მნიშვნელობა" || val === "კიბერბულინგი ეწოდება ისტ" || val === "კიბერბულინგი ეწოდება ისტ?"){
    response = `კიბერბულინგი - იგივე ონლაინბულინგი
    ან კიბერდევნა: ნიშნავს დაცინვას, შეურაცხყოფას,
    ადევნებას და სიტყვიერ ან ფსიქოლოგიურ
    ძალადობას, რომელიც გარკვეული სიხშირით ხორციელდება
    ინფორმაციული საკომუნიკაციო ტექნოლოგიების
    მეშვეობით. კიბერბულინგის მსხვერპლი
    გახლავთ პირი ან პირთა ჯგუფი, რომელსაც ამცირებენ,
    აშანტაჟებენ ან აშინებენ ძალადობრივი სახის
    ციფრული შეტყობინებების, კომენტარების და/ან
    პირადი სახის არასათანადო, დამამცირებელი და/ან
    პირადული შინაარსის ვიდეოების, ფოტოების ან
    კომენტარების გავრცელებით სოციალურ ქსელში.`//ტეჰსრჰყტდჯუყკ
  }else if (val === "რა არის კიბერდეითინგი" || val === "რა არის კიბერდეითინგი?" || val === "კიბერდეითინგი?" || val === "კიბერდეითინგი" || val === "კიბერდეითინგი." || val === "რა არის კიბერდეითინგი?" || val === "რა არის კიბერდეითინგი" || val === "კიბერდეითინგი არის რა?" || val === "კიბერდეითინგი არის რა" || val === "კიბერდეითინგი არის რა." || val === "კიბერდეითინგი ნიშნავს ისტ?" || val === "კიბერდეითინგი ნიშნავს ისტ." || val === "კიბერდეითინგი ნიშნავს ისტ" || val === "კიბერდეითინგი მნიშვნელობა." || val === "კიბერდეითინგი მნიშვნელობა" || val === "კიბერდეითინგის მნიშვნელობა." || val === "კიბერდეითინგის მნიშვნელობა" || val === "კიბერდეითინგი ეწოდება ისტ" || val === "კიბერდეითინგი ეწოდება ისტ?"){
    response = `ვირტუალური პაემანი 
    ინფორმაციული საკომუნიკაციო ტექნოლოგიების
    მეშვეობით, რაც, როგორც წესი, უცნობ 
    ადამიანებს ან იმ ადამიანებს შორის ხდება, რომელთა
    გაცნობაც ვირტუალურად მოხდა.`
  }else if (val === "რა არის კონფიდენციალურობა" || val === "რა არის კონფიდენციალურობა?" || val === "კონფიდენციალურობა?" || val === "კონფიდენციალურობა" || val === "კონფიდენციალურობა." || val === "რა არის კონფიდენციალურობა?" || val === "რა არის კონფიდენციალურობა" || val === "კონფიდენციალურობა არის რა?" || val === "კონფიდენციალურობა არის რა" || val === "კონფიდენციალურობა არის რა." || val === "კონფიდენციალურობა ნიშნავს ისტ?" || val === "კონფიდენციალურობა ნიშნავს ისტ." || val === "კონფიდენციალურობა ნიშნავს ისტ" || val === "კონფიდენციალურობის მნიშვნელობა." || val === "კონფიდენციალურობის მნიშვნელობა" || val === "კონფიდენციალურობის მნიშვნელობა." || val === "კონფიდენციალურობის მნიშვნელობა" || val === "კონფიდენციალურობა ეწოდება ისტ" || val === "კონფიდენციალურობა ეწოდება ისტ?"){
    response = `კონფიდენციალურობა - უფლება, რომელიც, რო-
    გორც წესი, გამოიყენება პერსონალური მონაცემე-
    ბის დასაცავად ნებისმიერი არაკანონიერი წვდომი-
    საგან. კონფიდენციალურობა ინტერნეტში: ინტერ-
    ნეტში მომხმარებლის ინფორმაციაზე კონტროლი.`
  }else if (val === "რა არის კონფიდენციალურობის დარღვევა" || val === "რა არის კონფიდენციალურობის დარღვევა?" || val === "კონფიდენციალურობის დარღვევა?" || val === "კონფიდენციალურობის დარღვევა" || val === "კონფიდენციალურობის დარღვევა." || val === "რა არის კონფიდენციალურობის დარღვევა?" || val === "რა არის კონფიდენციალურობის დარღვევა" || val === "კონფიდენციალურობის დარღვევა არის რა?" || val === "კონფიდენციალურობის დარღვევა არის რა" || val === "კონფიდენციალურობის დარღვევა არის რა." || val === "რას ნიშნავს კონფიდენციალურობის დარღვევა?" || val === "რას ნიშნავს კონფიდენციალურობის დარღვევა." || val === "რას ნიშნავს კონფიდენციალურობის დარღვევა" || val === "კონფიდენციალურობის დარღვევის მნიშვნელობა." || val === "კონფიდენციალურობის დარღვევის მნიშვნელობა" || val === "კონფიდენციალურობის დარღვევის მნიშვნელობა." || val === "კონფიდენციალურობის დარღვევის მნიშვნელობა" || val === "კონფიდენციალურობის დარღვეა ეწოდება რას?" || val === "რას კონფიდენციალურობის დარღვევა ეწოდება?"){
    response = `კონფიდენციალურობა - უფლება, რომელიც, რო-
    გორც წესი, გამოიყენება პერსონალური მონაცემე-
    ბის დასაცავად ნებისმიერი არაკანონიერი წვდომი-
    საგან. კონფიდენციალურობა ინტერნეტში: ინტერ-
    ნეტში მომხმარებლის ინფორმაციაზე კონტროლი.`//სრყჯრყჯყ
  }else if (val === "რა არის ლითი" || val === "რა არის ლითი?" || val === "ლითი?" || val === "ლითი" || val === "ლითი." || val === "რა არის ლითი?" || val === "რა არის ლითი" || val === "ლითი არის რა?" || val === "ლითი არის რა" || val === "ლითი არის რა." || val === "რას ნიშნავს ლითი?" || val === "რას ნიშნავს ლითი." || val === "რას ნიშნავს ლითი" ||  val === "ლითის მნიშვნელობა." || val === "ლითის მნიშვნელობა" || val === "რას ეწოდება ლითი" || val === "რას ეწოდება ლითი?"){
    response = `ილითი - ინტერნეტსლენგი, რომლის გამოყენების
    დროსაც ხდება ასოების ჩანაცვლება რიცხვებითა
    და სიმბოლოებით (მაგალითად: Leet – L33t).`
  }else if (val === "რა არის ლიურინგი" || val === "რა არის ლიურინგი?" || val === "ლიურინგი?" || val === "ლიურინგი" || val === "ლიურინგი." || val === "რა არის ლიურინგი?" || val === "რა არის ლიურინგი" || val === "ლიურინგი არის რა?" || val === "ლიურინგი არის რა" || val === "ლიურინგი არის რა." || val === "რას ნიშნავს ლიურინგი?" || val === "რას ნიშნავს ლიურინგი." || val === "რას ნიშნავს ლიურინგი" ||  val === "ლიურინგის მნიშვნელობა." || val === "ლიურინგის მნიშვნელობა" || val === "რას ეწოდება ლიურინგი" || val === "რას ეწოდება ლიურინგი?"){
    response = `ლიურინგი არის მოზიდვა, შეცდენა
    ან დაყოლიება, რომელიც გულისხმობს ხრიკების
    მეშვეობით არასრულწლოვანთა სექსუალურ 
    ქმედებაზე დაყოლიებას სრულწლოვანთა მიერ 
    ონლაინკავშირის მეშვეობით.`
  }else if (val === "რა არის მანიპულაცია" || val === "რა არის მანიპულაცია?" || val === "მანიპულაცია?" || val === "მანიპულაცია" || val === "მანიპულაცია." || val === "რა არის მანიპულაცია?" || val === "რა არის მანიპულაცია" || val === "მანიპულაცია არის რა?" || val === "მანიპულაცია არის რა" || val === "მანიპულაცია არის რა." || val === "რას ნიშნავს მანიპულაცია?" || val === "რას ნიშნავს მანიპულაცია." || val === "რას ნიშნავს მანიპულაცია" ||  val === "მანიპულაციის მნიშვნელობა." || val === "მანიპულაციის მნიშვნელობა" || val === "რას ეწოდება მანიპულაცია" || val === "რას ეწოდება მანიპულაცია?"){
    response = `ინტერნეტის მეშვეობით, პოტენციური
    მსხვერპლისთვის ზიანის მიყენების მიზნით შეცვლილი,
    ან დამახინჯებული ინფორმაციის გავრცელება
    ან მოდიფიკაცია ინტერნეტმომხმარებლების
    შეცდომაში შესაყვანად.`
  }else if (val === "რა არის მიმი" || val === "რა არის მიმი?" || val === "მიმი?" || val === "მიმი" || val === "მიმი." || val === "რა არის მიმი?" || val === "რა არის მიმი" || val === "მიმი არის რა?" || val === "მიმი არის რა" || val === "მიმი არის რა." || val === "რას ნიშნავს მიმი?" || val === "რას ნიშნავს მიმი." || val === "რას ნიშნავს მიმი" ||  val === "მიმის მნიშვნელობა." || val === "მიმის მნიშვნელობა" || val === "რას ეწოდება მიმი" || val === "რას ეწოდება მიმი?"){
    response = `მიმი არის გამოსახულება, ნახატი ან გიფი, 
    დამატებული ტექსტზე კონკრეტული სიტუაციების,
    გრძნობების ან რეაქციის გამოსახატად; როგორც
    წესი, ატარებს იუმორისტულ ხასიათს. მისი 
    გაზიარება მეტწილად ხდება სოციალური ქსელების
    მეშვეობით.`
  }else if (val === "რა არის მონიშვნა" || val === "რა არის მონიშვნა?" || val === "მონიშვნა?" || val === "მონიშვნა" || val === "მონიშვნა." || val === "რა არის მონიშვნა?" || val === "რა არის მონიშვნა" || val === "მონიშვნა არის რა?" || val === "მონიშვნა არის რა" || val === "მონიშვნა არის რა." || val === "რას ნიშნავს მონიშვნა?" || val === "რას ნიშნავს მონიშვნა." || val === "რას ნიშნავს მონიშვნა" ||  val === "მონიშვნის მნიშვნელობა." || val === "მონიშვნის მნიშვნელობა" || val === "რას ეწოდება მონიშვნა" || val === "რას ეწოდება მონიშვნა?"){
    response = `იარლიყის მიბმა, მონიშვნა სოციალურ მედიაში.`
  }else if (val === "რა არის დათაგვა" || val === "რა არის დათაგვა?" || val === "დათაგვა?" || val === "დათაგვა" || val === "დათაგვა." || val === "რა არის დათაგვა?" || val === "რა არის დათაგვა" || val === "დათაგვა არის რა?" || val === "დათაგვა არის რა" || val === "დათაგვა არის რა." || val === "რას ნიშნავს დათაგვა?" || val === "რას ნიშნავს დათაგვა." || val === "რას ნიშნავს დათაგვა" ||  val === "დათაგვის მნიშვნელობა." || val === "დათაგვის მნიშვნელობა" || val === "რას ეწოდება დათაგვა" || val === "რას ეწოდება დათაგვა?"){
    response = `იარლიყის მიბმა, მონიშვნა სოციალურ მედიაში.`
  }else if (val === "რა არის ონლაინგამოწვევა" || val === "რა არის ონლაინგამოწვევა?" || val === "ონლაინგამოწვევა?" || val === "ონლაინგამოწვევა" || val === "ონლაინგამოწვევა." || val === "რა არის ონლაინგამოწვევა?" || val === "რა არის ონლაინგამოწვევა" || val === "ონლაინგამოწვევა არის რა?" || val === "ონლაინგამოწვევა არის რა" || val === "ონლაინგამოწვევა არის რა." || val === "რას ნიშნავს ონლაინგამოწვევა?" || val === "რას ნიშნავს ონლაინგამოწვევა." || val === "რას ნიშნავს ონლაინგამოწვევა" ||  val === "ონლაინგამოწვევის მნიშვნელობა." || val === "ონლაინგამოწვევის მნიშვნელობა" || val === "რას ეწოდება ონლაინგამოწვევა" || val === "რას ეწოდება ონლაინგამოწვევა?"){
    response = `ონლაინთამაში ან გამოწვევა, რომელიც შექმნილია სოლიდარობის
    გამოსახატავად, ზოგჯერ კი გართობის ან
    ზიანის მიყენების მიზნით; პოპულარობით გამოირჩევა
    სოციალურ ქსელებში (მაგალითად: გადაისხი
    ყინულიანი სათლი, დარიჩინის გამოწვევა და სხვა).
    შესაძლებელია იყოს ჯანმრთელობისათვის სახიფათო ან სასიკვდილოც კი.`
  }else if (val === "რა არის ონლაინ გამოწვევა" || val === "რა არის ონლაინ გამოწვევა?" || val === "ონლაინ გამოწვევა?" || val === "ონლაინ გამოწვევა" || val === "ონლაინ გამოწვევა." || val === "რა არის ონლაინ გამოწვევა?" || val === "რა არის ონლაინ გამოწვევა" || val === "ონლაინ გამოწვევა არის რა?" || val === "ონლაინ გამოწვევა არის რა" || val === "ონლაინ გამოწვევა არის რა." || val === "რას ნიშნავს ონლაინ გამოწვევა?" || val === "რას ნიშნავს ონლაინ გამოწვევა." || val === "რას ნიშნავს ონლაინ გამოწვევა" ||  val === "ონლაინ გამოწვევის მნიშვნელობა." || val === "ონლაინ გამოწვევის მნიშვნელობა" || val === "რას ეწოდება ონლაინ გამოწვევა" || val === "რას ეწოდება ონლაინ გამოწვევა?"){
    response = `ონლაინ გამოწვევა არის ონლაინთამაში ან გამოწვევა, რომელიც შექმნილია სოლიდარობის
    გამოსახატავად, ზოგჯერ კი გართობის ან
    ზიანის მიყენების მიზნით; პოპულარობით გამოირჩევა
    სოციალურ ქსელებში (მაგალითად: გადაისხი
    ყინულიანი სათლი, დარიჩინის გამოწვევა და სხვა).
    შესაძლებელია იყოს ჯანმრთელობისათვის სახიფათო ან სასიკვდილოც კი.`
  }else if (val === "რა არის ონლაინი" || val === "რა არის ონლაინი?" || val === "ონლაინი?" || val === "ონლაინი" || val === "ონლაინი." || val === "რა არის ონლაინი?" || val === "რა არის ონლაინი" || val === "ონლაინი არის რა?" || val === "ონლაინი არის რა" || val === "ონლაინი არის რა." || val === "რას ნიშნავს ონლაინი?" || val === "რას ნიშნავს ონლაინი." || val === "რას ნიშნავს ონლაინი" ||  val === "ონლაინის მნიშვნელობა." || val === "ონლაინის მნიშვნელობა" || val === "რას ეწოდება ონლაინი" || val === "რას ეწოდება ონლაინი?"){
    response = `ონლაინი ნიშნავს ინტერნეტში ჩართულს ინტერნეტში ჩართული.`
  }else if (val === "რა არის ოფლაინი" || val === "რა არის ოფლაინი?" || val === "ოფლაინი?" || val === "ოფლაინი" || val === "ოფლაინი." || val === "რა არის ოფლაინი?" || val === "რა არის ოფლაინი" || val === "ოფლაინი არის რა?" || val === "ოფლაინი არის რა" || val === "ოფლაინი არის რა." || val === "რას ნიშნავს ოფლაინი?" || val === "რას ნიშნავს ოფლაინი." || val === "რას ნიშნავს ოფლაინი" ||  val === "ოფლაინის მნიშვნელობა." || val === "ოფლაინის მნიშვნელობა" || val === "რას ეწოდება ოფლაინი" || val === "რას ეწოდება ოფლაინი?"){
    response = `ოფლაინი ნიშნავს ინტერნეტიდან გამორთულს ინტერნეტში ჩართული.`
  }else if (val === "რა არის პექი" || val === "რა არის პექი?" || val === "პექი?" || val === "პექი" || val === "პექი." || val === "რა არის პექი?" || val === "რა არის პექი" || val === "პექი არის რა?" || val === "პექი არის რა" || val === "პექი არის რა." || val === "რას ნიშნავს პექი?" || val === "რას ნიშნავს პექი." || val === "რას ნიშნავს პექი" ||  val === "პექის მნიშვნელობა." || val === "პექის მნიშვნელობა" || val === "რას ეწოდება პექი" || val === "რას ეწოდება პექი?"){
    response = `პექი არის ინტიმური ფოტოების ან 
    ვიდეოების კომპლექტი, რომელიც განთავსებულია 
    ციფრულ ფორმატში.`
  }else if (val === "რა არის პორტალი" || val === "რა არის პორტალი?" || val === "პორტალი?" || val === "პორტალი" || val === "პორტალი." || val === "რა არის პორტალი?" || val === "რა არის პორტალი" || val === "პორტალი არის რა?" || val === "პორტალი არის რა" || val === "პორტალი არის რა." || val === "რას ნიშნავს პორტალი?" || val === "რას ნიშნავს პორტალი." || val === "რას ნიშნავს პორტალი" ||  val === "პორტალის მნიშვნელობა." || val === "პორტალის მნიშვნელობა" || val === "რას ეწოდება პორტალი" || val === "რას ეწოდება პორტალი?"){
    response = `ვებგვერდი, რომელიც სხვა ვებგვერდების
    ბმულების გაზიარების საშუალებას აძლევს მომხმარებელს.`
  }else if (val === "რა არის სენსიტიური მონაცემები" || val === "რა არის სენსიტიური მონაცემები?" || val === "სენსიტიური მონაცემები?" || val === "სენსიტიური მონაცემები" || val === "სენსიტიური მონაცემები." || val === "რა არის სენსიტიური მონაცემები?" || val === "რა არის სენსიტიური მონაცემები" || val === "სენსიტიური მონაცემები არის რა?" || val === "სენსიტიური მონაცემები არის რა" || val === "სენსიტიური მონაცემები არის რა." || val === "რას ნიშნავს სენსიტიური მონაცემები?" || val === "რას ნიშნავს სენსიტიური მონაცემები." || val === "რას ნიშნავს სენსიტიური მონაცემები" ||  val === "სენსიტიური მონაცემების მნიშვნელობა." || val === "სენსიტიური მონაცემების მნიშვნელობა" || val === "რას ეწოდება სენსიტიური მონაცემები" || val === "რას ეწოდება სენსიტიური მონაცემები?"){
    response = `პერსონალური მონაცემები,
    რომლებიც ეხება ადამიანის ფიზიკურ და
    ზნეობრივ მონაცემებს, მათ პირად ცხოვრებას,
    თვისებებს, რასობრივ წარმომავლობას, იდეოლოგიას,
    პოლიტიკურ შეხედულებებს, რწმენას ან რელიგიურ
    მრწამსს, ნასამართლეობის მონაცემებს,
    ფიზიკური ან მენტალური ჯანმრთელობის მდგომარეობასა
    და სექსუალურ ორიენტაციას.`
  }else if (val === "რა არის სესია" || val === "რა არის სესია?" || val === "სესია?" || val === "სესია" || val === "სესია." || val === "რა არის სესია?" || val === "რა არის სესია" || val === "სესია არის რა?" || val === "სესია არის რა" || val === "სესია არის რა." || val === "რას ნიშნავს სესია?" || val === "რას ნიშნავს სესია." || val === "რას ნიშნავს სესია" ||  val === "სესიის მნიშვნელობა." || val === "სესიის მონაცემების მნიშვნელობა" || val === "რას ეწოდება სესია" || val === "რას ეწოდება სესია?"){
    response = `ერთეული, რომელიც აღნიშნავს კომპიუტერის, ან
    ინტერნეტის გამოყენების ერთ კონკრეტულ შემთხვევას.`
  }else if (val === "რა არის სექსტინგი" || val === "რა არის სექსტინგი?" || val === "სექსტინგი?" || val === "სექსტინგი" || val === "სექსტინგი." || val === "რა არის სექსტინგი?" || val === "რა არის სექსტინგი" || val === "სექსტინგი არის რა?" || val === "სექსტინგი არის რა" || val === "სექსტინგი არის რა." || val === "რას ნიშნავს სექსტინგი?" || val === "რას ნიშნავს სექსტინგი." || val === "რას ნიშნავს სექსტინგი" ||  val === "სექსტინგის მნიშვნელობა." || val === "სექსტინგის მნიშვნელობა" || val === "რას ეწოდება სექსტინგი" || val === "რას ეწოდება სექსტინგი?"){
    response = `სექსტინგი არის ეროტიკული ან პორნოგრა-
    ფიული შინაარსის შეტყობინებების ან აუდიოვიზუალური
    მასალის გაგზავნა ციფრული საშუალებებით;
    სექსტინგი ხშირად წინ უძღვის კიბერბულინგს.`
  }else if (val === "რა არის სექსუალური გამოძალვა" || val === "რა არის სექსუალური გამოძალვა?" || val === "სექსუალური გამოძალვა?" || val === "სექსუალური გამოძალვა" || val === "სექსუალური გამოძალვა." || val === "რა არის სექსუალური გამოძალვა?" || val === "რა არის სექსუალური გამოძალვა" || val === "სექსუალური გამოძალვა არის რა?" || val === "სექსუალური გამოძალვა არის რა" || val === "სექსუალური გამოძალვა არის რა." || val === "რას ნიშნავს სექსუალური გამოძალვა?" || val === "რას ნიშნავს სექსუალური გამოძალვა." || val === "რას ნიშნავს სექსუალური გამოძალვა" ||  val === "სექსუალური გამოძალვის მნიშვნელობა." || val === "სექსუალური გამოძალვის მნიშვნელობა" || val === "რას ეწოდება სექსუალური გამოძალვა" || val === "რას ეწოდება სექსუალური გამოძალვა?"){
    response = `სექსუალური გამოძალვა არის ფულის გამოძალვის, ან სექსუალურ მომსახურებაზე 
    დაყოლიების ფორმა სექსუალური ქმედებების 
    გამომჟღავნების მუქარის ქვეშ.`
  }else if (val === "რა არის სთორი" || val === "რა არის სთორი?" || val === "სთორი?" || val === "სთორი" || val === "სთორი." || val === "რა არის სთორი?" || val === "რა არის სთორი" || val === "სთორი არის რა?" || val === "სთორი არის რა" || val === "სთორი არის რა." || val === "რას ნიშნავს სთორი?" || val === "რას ნიშნავს სთორი." || val === "რას ნიშნავს სთორი" ||  val === "სთორის მნიშვნელობა." || val === "სთორის მნიშვნელობა" || val === "რას ეწოდება სთორი" || val === "რას ეწოდება სთორი?"){
    response = `პოსტები ყოველდღიური აქტივობების
    შესახებ, ვიდეოები ან ფოტოები, დამატებული
    სოციალურ ქსელებში, როგორიცაა ფეისბუქი
    ან ინსტაგრამი, რომლებიც ქრება 24 საათის შემდგომ.`
  }else if (val === "რა არის სოციალური ქსელი" || val === "რა არის სოციალური ქსელი?" || val === "სოციალური ქსელი?" || val === "სოციალური ქსელი" || val === "სოციალური ქსელი." || val === "რა არის სოციალური ქსელი?" || val === "რა არის სოციალური ქსელი" || val === "სოციალური ქსელი არის რა?" || val === "სოციალური ქსელი არის რა" || val === "სოციალური ქსელი არის რა." || val === "რას ნიშნავს სოციალური ქსელი?" || val === "რას ნიშნავს სოციალური ქსელი." || val === "რას ნიშნავს სოციალური ქსელი" ||  val === "სოციალური ქსელის მნიშვნელობა." || val === "სოციალური ქსელის მნიშვნელობა" || val === "რას ეწოდება სოციალური ქსელი" || val === "რას ეწოდება სოციალური ქსელი?"){
    response = `სოციალურ ქსელი არის ვებგვერდი ან აპლიკაცია, რო-
    მელიც ინტერნეტში აერთიანებს მომხმარებელთა
    ჯგუფებს (მეგობრებს, ნათესავებს, ნაცნობებს, თანამშრომლებს)
    მათი საერთო ინტერესების ირგვლივ.`
  }else if (val === "რა არის სპამი" || val === "რა არის სპამი?" || val === "სპამი?" || val === "სპამი" || val === "სპამი." || val === "რა არის სპამი?" || val === "რა არის სპამი" || val === "სპამი არის რა?" || val === "სპამი არის რა" || val === "სპამი არის რა." || val === "რას ნიშნავს სპამი?" || val === "რას ნიშნავს სპამი." || val === "რას ნიშნავს სპამი" ||  val === "სპამის მნიშვნელობა." || val === "სპამის მნიშვნელობა" || val === "რას ეწოდება სპამი" || val === "რას ეწოდება სპამი?"){
    response = `სპამი (ინგლ. Spam) არის ინტერნეტის მეშვეობით მიღებული შე-
    უსაბამო შეტყობინებები, როგორც წესი, გათვლილი
    დიდი რაოდენობით მომხმარებელთათვის; შესაძლებელია
    ატარებდეს საფრთხისშემცველ ინფორმაციას
    ან ვირუსებს, ან უბრალოდ ვრცელდებოდეს
    გარკვეული პროდუქციის რეკლამირების მიზნით.`
  }else if (val === "რა არის სპიმი" || val === "რა არის სპიმი?" || val === "სპიმი?" || val === "სპიმი" || val === "სპიმი." || val === "რა არის სპიმი?" || val === "რა არის სპიმი" || val === "სპიმი არის რა?" || val === "სპიმი არის რა" || val === "სპიმი არის რა." || val === "რას ნიშნავს სპიმი?" || val === "რას ნიშნავს სპიმი." || val === "რას ნიშნავს სპიმი" ||  val === "სპიმის მნიშვნელობა." || val === "სპიმის მნიშვნელობა" || val === "რას ეწოდება სპიმი" || val === "რას ეწოდება სპიმი?"){
    response = `სპიმი (ingl. Spim) არის სპამი, რომელიც ვრცელდება ჩატის
    მეშვეობით.`
  }else if (val === "რა არის სტრიმინგი" || val === "რა არის სტრიმინგი?" || val === "სტრიმინგი?" || val === "სტრიმინგი" || val === "სტრიმინგი." || val === "რა არის სტრიმინგი?" || val === "რა არის სტრიმინგი" || val === "სტრიმინგი არის რა?" || val === "სტრიმინგი არის რა" || val === "სტრიმინგი არის რა." || val === "რას ნიშნავს სტრიმინგი?" || val === "რას ნიშნავს სტრიმინგი." || val === "რას ნიშნავს სტრიმინგი" ||  val === "სტრიმინგის მნიშვნელობა." || val === "სტრიმინგის მნიშვნელობა" || val === "რას ეწოდება სტრიმინგი" || val === "რას ეწოდება სტრიმინგი?"){
    response = `სტრიმინგი (ინგლ. Streaming): პირდაპირი ეთერის 
    ფორმა, რომელიც ვრცელდება ინტერნეტის მეშვეობით.`
  }else if (val === "რა არის ტროლი" || val === "რა არის ტროლი?" || val === "ტროლი?" || val === "ტროლი" || val === "ტროლი." || val === "რა არის ტროლი?" || val === "რა არის ტროლი" || val === "ტროლი არის რა?" || val === "ტროლი არის რა" || val === "ტროლი არის რა." || val === "რას ნიშნავს ტროლი?" || val === "რას ნიშნავს ტროლი." || val === "რას ნიშნავს ტროლი" ||  val === "ტროლის მნიშვნელობა." || val === "ტროლის მნიშვნელობა" || val === "რას ეწოდება ტროლი" || val === "რას ეწოდება ტროლი?"){
    response = `მომხმარებელი, რომელიც სოციალურ ქსელში
    აქვეყნებს შეტყობინებებსა და კომენტარებს ბოროტი
    ან მაპროვოცირებელი განზრახვით.`
  }else if (val === "რა არის დიფ ვები" || val === "რა არის დიფ ვები?" || val === "დიფ ვები?" || val === "დიფ ვები" || val === "დიფ ვები." || val === "რა არის დიფ ვები?" || val === "რა არის დიფ ვები" || val === "დიფ ვები არის რა?" || val === "დიფ ვები არის რა" || val === "დიფ ვები არის რა." || val === "რას ნიშნავს დიფ ვები?" || val === "რას ნიშნავს დიფ ვები." || val === "რას ნიშნავს დიფ ვები" ||  val === "დიფ ვების მნიშვნელობა." || val === "დიფ ვების მნიშვნელობა" || val === "რას ეწოდება დიფ ვები" || val === "რას ეწოდება დიფ ვები?"){
    response = `დიფ ვები (ინგლ. Deep web) არის სხვადასხვა ვებგვერდების
    საცავი, რომელთა ჩვენება არ შეუძლია
    გუგლს და სხვა საძიებო სისტემებს, ვინაიდან, როგორც
    წესი, ისინი არღვევენ ინტერნეტის მოხმარების
    და ახალი ამბების კანონით დაწესებულ ნორმებს.`
  }else if (val === "რა არის ფეისბუქი" || val === "რა არის ფეისბუქი?" || val === "ფეისბუქი?" || val === "ფეისბუქი" || val === "ფეისბუქი." || val === "რა არის ფეისბუქი?" || val === "რა არის ფეისბუქი" || val === "ფეისბუქი არის რა?" || val === "ფეისბუქი არის რა" || val === "ფეისბუქი არის რა." || val === "რას ნიშნავს ფეისბუქი?" || val === "რას ნიშნავს ფეისბუქი." || val === "რას ნიშნავს ფეისბუქი" ||  val === "ფეისბუქის მნიშვნელობა." || val === "ფეისბუქის მნიშვნელობა" || val === "რას ეწოდება ფეისბუქი" || val === "რას ეწოდება ფეისბუქი?"){
    response = `ფეისბუქი (ინგლ. Facebook) არის პოპულარული სოციალური
    ქსელი, რომელიც შექმნილია ადამიანების (მეგობრები,
    ნათესავები კოლეგები და სხვა) დასაკავშირებლად,
    სადაც მომხმარებელს შეუძლია 
    გააზიაროს ინფორმაცია, ახალი ამბები, ფოტოები და
    ვიდეომასალა.`
  }else if (val === "რა არის ფეისბუქ მესინჯერი" || val === "რა არის ფეისბუქ მესინჯერი?" || val === "ფეისბუქ მესინჯერი?" || val === "ფეისბუქ მესინჯერი" || val === "ფეისბუქ მესინჯერი." || val === "რა არის ფეისბუქ მესინჯერი?" || val === "რა არის ფეისბუქ მესინჯერი" || val === "ფეისბუქ მესინჯერი არის რა?" || val === "ფეისბუქ მესინჯერი არის რა" || val === "ფეისბუქ მესინჯერი არის რა." || val === "რას ნიშნავს ფეისბუქ მესინჯერი?" || val === "რას ნიშნავს ფეისბუქ მესინჯერი." || val === "რას ნიშნავს ფეისბუქ მესინჯერი" ||  val === "ფეისბუქ მესინჯერის მნიშვნელობა." || val === "ფეისბუქ მესინჯერის მნიშვნელობა" || val === "რას ეწოდება ფეისბუქ მესინჯერი" || val === "რას ეწოდება ფეისბუქ მესინჯერი?"){
    response = `ფეისბუქის მესინჯერი (ინგლ. Facebook Messenger) არის
    ფეისბუქის სოციალური ქსელის შეტყობინებების
    აპლიკაცია; შემუშავებულია, როგორც ფეისბუქის
    ჩათი.`
  }else if (val === "რა არის ფილტრი" || val === "რა არის ფილტრი?" || val === "ფილტრი?" || val === "ფილტრი" || val === "ფილტრი." || val === "რა არის ფილტრი?" || val === "რა არის ფილტრი" || val === "ფილტრი არის რა?" || val === "ფილტრი არის რა" || val === "ფილტრი არის რა." || val === "რას ნიშნავს ფილტრი?" || val === "რას ნიშნავს ფილტრი." || val === "რას ნიშნავს ფილტრი" ||  val === "ფილტრის მნიშვნელობა." || val === "ფილტრის მნიშვნელობა" || val === "რას ეწოდება ფილტრი" || val === "რას ეწოდება ფილტრი?"){
    response = `ფილტრი ეფექტები, გაფერადების ან დაჩრდილვის 
    ოფციები, დეფორმაციები და სხვა, რომლებსაც 
    იყენებენ ფოტოებზე; როგორც წესი, ფილტრებს იყენებენ
    ინსტაგრამის, ფეისბუქის, სნეპჩეტის, ან სხვა 
    სოციალური ქსელის აპლიკაციებისათვის.`
  }else if (val === "რა არის ფიშინგი" || val === "რა არის ფიშინგი?" || val === "ფიშინგი?" || val === "ფიშინგი" || val === "ფიშინგი." || val === "რა არის ფიშინგი?" || val === "რა არის ფიშინგი" || val === "ფიშინგი არის რა?" || val === "ფიშინგი არის რა" || val === "ფიშინგი არის რა." || val === "რას ნიშნავს ფიშინგი?" || val === "რას ნიშნავს ფიშინგი." || val === "რას ნიშნავს ფიშინგი" ||  val === "ფიშინგის მნიშვნელობა." || val === "ფიშინგის მნიშვნელობა" || val === "რას ეწოდება ფიშინგი" || val === "რას ეწოდება ფიშინგი?"){
    response = `ფიშინგი (ინგლ. Fishing) არის ციფრული თაღლითობა, 
    როგორც წესი, განხორციელებული ელექტრონული
    ფოსტის მეშვეობით, რაც გამოიხატება ყალბი 
    შეთავაზებებით მომხმარებლის მოსატყუებლად, 
    კონფიდენციალური ინფორმაციის გამოძალვის მიზნით,
    როგორიცაა, მაგალითად, საბანკო ანგარიშები, 
    პაროლები და სხვა.`
  }else if (val === "რა არის ფლეიმინგი" || val === "რა არის ფლეიმინგი?" || val === "ფლეიმინგი?" || val === "ფლეიმინგი" || val === "ფლეიმინგი." || val === "რა არის ფლეიმინგი?" || val === "რა არის ფლეიმინგი" || val === "ფლეიმინგი არის რა?" || val === "ფლეიმინგი არის რა" || val === "ფლეიმინგი არის რა." || val === "რას ნიშნავს ფლეიმინგი?" || val === "რას ნიშნავს ფლეიმინგი." || val === "რას ნიშნავს ფლეიმინგი" ||  val === "ფლეიმინგის მნიშვნელობა." || val === "ფლეიმინგის მნიშვნელობა" || val === "რას ეწოდება ფლეიმინგი" || val === "რას ეწოდება ფლეიმინგი?"){
    response = `ფლეიმინგი (ინგლ Flaming) არის შეურაცხმყოფელი 
    გამოთქმების ან ძალადობრივი ენის/შეტყობინებების 
    გამოყენება ციფრულ სივრცეში.`
  }else if (val === "რა არის ფორუმი" || val === "რა არის ფორუმი?" || val === "ფორუმი?" || val === "ფორუმი" || val === "ფორუმი." || val === "რა არის ფორუმი?" || val === "რა არის ფორუმი" || val === "ფორუმი არის რა?" || val === "ფორუმი არის რა" || val === "ფორუმი არის რა." || val === "რას ნიშნავს ფორუმი?" || val === "რას ნიშნავს ფორუმი." || val === "რას ნიშნავს ფორუმი" ||  val === "ფორუმის მნიშვნელობა." || val === "ფორუმის მნიშვნელობა" || val === "რას ეწოდება ფორუმი" || val === "რას ეწოდება ფორუმი?"){
    response = `ფორუმი არის ვებგვერდი ან ვირტუალური 
    სივრცე, რომლის გამოყენება ხდება მრავალი 
    მომხმარებლის მიერ ონლაინდისკუსიისათვის ან 
    იდეებისა და აზრების გასაცვლელად სხვადასხვა თემის
    ირგვლივ.`
  }else if (val === "რა არის ქეთფიშინგი" || val === "რა არის ქეთფიშინგი?" || val === "ქეთფიშინგი?" || val === "ქეთფიშინგი" || val === "ქეთფიშინგი." || val === "რა არის ქეთფიშინგი?" || val === "რა არის ქეთფიშინგი" || val === "ქეთფიშინგი არის რა?" || val === "ქეთფიშინგი არის რა" || val === "ქეთფიშინგი არის რა." || val === "რას ნიშნავს ქეთფიშინგი?" || val === "რას ნიშნავს ქეთფიშინგი." || val === "რას ნიშნავს ქეთფიშინგი" ||  val === "ქეთფიშინგის მნიშვნელობა." || val === "ქეთფიშინგის მნიშვნელობა" || val === "რას ეწოდება ქეთფიშინგი" || val === "რას ეწოდება ქეთფიშინგი?"){
    response = `ქეთფიშინგი (ინგლ. Catfishing) არის ონლაინ ყალბი 
    პროფილის ან მომხმარებლის შექმნა. ძირითადად 
    გავრცელებულია სოციალურ ქსელში და ონლაინ 
    გაცნობის ვებგვერდებზე, სადაც ადამიანები მალავენ
    პერსონალურ ინფორმაციას ან ირჩევენ 
    ინკოგნიტოდ მოქმედებას.`
  }else if (val === "რა არის შევიწროება" || val === "რა არის შევიწროება?" || val === "შევიწროება?" || val === "შევიწროება" || val === "შევიწროება." || val === "რა არის შევიწროება?" || val === "რა არის შევიწროება" || val === "შევიწროება არის რა?" || val === "შევიწროება არის რა" || val === "შევიწროება არის რა." || val === "რას ნიშნავს შევიწროება?" || val === "რას ნიშნავს შევიწროება." || val === "რას ნიშნავს შევიწროება" ||  val === "შევიწროების მნიშვნელობა." || val === "შევიწროების მნიშვნელობა" || val === "რას ეწოდება შევიწროება" || val === "რას ეწოდება შევიწროება?"){
    response = `შევიწროება (ინგლ. Harassment) არის აგრესიული, განმეორებითი 
    და გამაღიზიანებელი ქცევა, რაც იწვევს დისკომფორტს, 
    ან აკნინებს ადამიანის, ან ადამიანთა ჯგუფის გრძნობებს.`
  }else if (val === "რა არის ჩატი" || val === "რა არის ჩატი?" || val === "ჩატი?" || val === "ჩატი" || val === "ჩატი." || val === "რა არის ჩატი?" || val === "რა არის ჩატი" || val === "ჩატი არის რა?" || val === "ჩატი არის რა" || val === "ჩატი არის რა." || val === "რას ნიშნავს ჩატი?" || val === "რას ნიშნავს ჩატი." || val === "რას ნიშნავს ჩატი" ||  val === "ჩატის მნიშვნელობა." || val === "ჩატის მნიშვნელობა" || val === "რას ეწოდება ჩატი" || val === "რას ეწოდება ჩატი?"){
    response = `ჩატი (ინგლ. Chat) არის ციფრული დიალოგისთვის, 
    საუბრისთვის ან ინფორმაციის გაცვლისთვის განკუთვნილი
    პროგრამა ან აპლიკაცია, რომლის მეშვეობითაც
    აგრეთვე შესაძლებელია ვიდეოების,
    აუდიოფაილებისა და ფოტოების გაგზავნა.`
  }else if (val === "რა არის ძალადობა" || val === "რა არის ძალადობა?" || val === "ძალადობა?" || val === "ძალადობა" || val === "ძალადობა." || val === "რა არის ძალადობა?" || val === "რა არის ძალადობა" || val === "ძალადობა არის რა?" || val === "ძალადობა არის რა" || val === "ძალადობა არის რა." || val === "რას ნიშნავს ძალადობა?" || val === "რას ნიშნავს ძალადობა." || val === "რას ნიშნავს ძალადობა" ||  val === "ძალადობას მნიშვნელობა." || val === "ძალადობას მნიშვნელობა" || val === "რას ეწოდება ძალადობა" || val === "რას ეწოდება ძალადობა?"){
    response = `ძალადობა არის მოიცავს ყველა ფორმის ფიზიკურ ან 
    გონებრივ ზიანსა და ექსპლოატაციას.`
  }else if (val === "რა არის ჰაკერი" || val === "რა არის ჰაკერი?" || val === "ჰაკერი?" || val === "ჰაკერი" || val === "ჰაკერი." || val === "ვინ არის ჰაკერი?" || val === "ვინ არის ჰაკერი" || val === "ჰაკერი არის ვინ?" || val === "ჰაკერი არის ვინ" || val === "ჰაკერი არის ვინ." || val === "რას ნიშნავს ჰაკერი?" || val === "რას ნიშნავს ჰაკერი." || val === "რას ნიშნავს ჰაკერი" ||  val === "ჰაკერის მნიშვნელობა." || val === "ჰაკერის მნიშვნელობა" || val === "ვის ეწოდება ჰაკერი" || val === "ვის ეწოდება ჰაკერი?"){
    response = `<p>ჰაკერი (ინგლ.Hacker) არის პროგრამირების ექსპერტი, 
    პროგრამული უზრუნველყოფის მანიპულაციისა და სხვა
    კომპიუტერული უნარ-ჩვევების მქონე სპეციალისტი,
    რომელიც ფლობს კომპიუტერულ სისტემებში 
    შეღწევის უნარებს, ხშირად მათში ცვლილებების შეტანის
    მიზნით. ჰაკერები იყოფა 3 ტიპის კატეგორიად:</p>

    <p>ტიპი 1:
    თეთრქუდიანი ჰაკერები“ (ინგლ. White hat hackers)
    18 – მათ მოტივაციას წარმოადგენს სისტემის 
    უსაფრთხოების ხარვეზების მოძიება და პოვნა, ასევე 
    ნაკლოვანებების აღმოჩენა და მფლობელი კომპანიებისათვის
    აღნიშნულის დაუყოვნებლივ შეტყობინება.</p>

    <p>ტიპი 2:
    შავქუდიანი ჰაკერები (ინგლ. Black hat hackers) –
    იძიებენ კომპიუტერული სისტემების უსაფრთხოების
    ხარვეზებს და იყენებენ მათ თავიანთ სასარგებლოდ,
    კერძოდ: მოიპოვებენ მონაცემებს, პაროლებს და
    საკრედიტო ბარათების ნომრებს, წვდომის კოდებს,
    საბანკო რეკვიზიტებს და იღებენ ფინანსურ 
    სარგებელს აღნიშნული ინფორმაციის მეშვეობით.</p>

    <p>ტიპი 3:
    რუხქუდიანი ჰაკერები (ინგლ. Grey hat hackers) – ეს
    უკანასკნელნი არიან თეთრსა და შავს შორის 
    არსებული ჰაკერების ტიპი; ისინი იძიებენ და აღმოაჩენენ
    სისტემურ ნაკლოვანებებს, რათა გაყიდონ 
    ინფორმაცია მათ შესახებ. იმ შემთხვევაში, თუ ისინი ვერ
    იღებენ რაიმე ტიპის სარგებელს აღნიშნული 
    ინფორმაციით, მას საჯაროდ აქვეყნებენ მფლობელი 
    კომპანიების საწინააღმდეგოდ.</p>`
  }else if (val === "რა არის ჰაშთაგი" || val === "რა არის ჰაშთაგი?" || val === "ჰაშთაგი?" || val === "ჰაშთაგი" || val === "ჰაშთაგი." || val === "რა არის ჰაშთაგი?" || val === "რა არის ჰაშთაგი" || val === "ჰაშთაგი არის რა?" || val === "ჰაშთაგი არის რა" || val === "ჰაშთაგი არის რა." || val === "რას ნიშნავს ჰაშთაგი?" || val === "რას ნიშნავს ჰაშთაგი." || val === "რას ნიშნავს ჰაშთაგი" ||  val === "ჰაშთაგის მნიშვნელობა." || val === "ჰაშთაგის მნიშვნელობა" || val === "რას ეწოდება ჰაშთაგი" || val === "რას ეწოდება ჰაშთაგი?"){
    response = `ჰაშთაგი (ინგლ. Hashtag) არის საკვანძო სიტყვა, ფრაზა, 
    ან ალფაციფრული სიმბოლოები, რომელიც გამოხატულია
    გაბმულად, სივრცის გამოტოვების გარეშე და 
    აღნიშნულია # ნიშნით; გამოიყენება მეტწილად სოციალური
    მედიის ვებგვერდებზე და აპლიკაციებზე, განსაკუთრებით
    კი ტვიტერზე და ინსტაგრამზე, კონკრეტულ თემაზე
    შეტყობინებების იდენტიფიცირებისათვის.`
  }else if (val === "რა არის ჰეითერი" || val === "რა არის ჰეითერი?" || val === "ჰეითერი?" || val === "ჰეითერი" || val === "ჰეითერი." || val === "ვინ არის ჰეითერი?" || val === "ვინ არის ჰეითერი" || val === "ჰეითერი არის ვინ?" || val === "ჰეითერი არის ვინ" || val === "ჰეითერი არის ვინ." || val === "რას ნიშნავს ჰეითერი?" || val === "რას ნიშნავს ჰეითერი." || val === "რას ნიშნავს ჰეითერი" ||  val === "ჰეითერის მნიშვნელობა." || val === "ჰეითერის მნიშვნელობა" || val === "ვის ეწოდება ჰეითერი" || val === "ვის ეწოდება ჰეითერი?"){ 
    response = `ჰეითერი (ინგლ. Hater) არის ინტერნეტმომხარებლები,
    იგივე გამომწერები, რომლებიც სოციალურ ქსელებში,
     აპლიკაციებში, ან ჩატში ტოვებენ ნეგატიურ
    კომენტარებს გარკვეული თემების 
    ან სხვა მომხმარებლების წინააღმდეგ.`
  }else if (val === "რა არის ჰეითერები" || val === "რა არის ჰეითერები?" || val === "ჰეითერები?" || val === "ჰეითერები" || val === "ჰეითერები." || val === "ვინ არიან ჰეითერები?" || val === "ვინ არიან ჰეითერები" || val === "ჰეითერები არიან ვინ?" || val === "ჰეითერები არიან ვინ" || val === "ჰეითერები არიან ვინ." || val === "რას ნიშნავს ჰეითერები?" || val === "რას ნიშნავს ჰეითერები." || val === "რას ნიშნავს ჰეითერები" ||  val === "ჰეითერების მნიშვნელობა." || val === "ჰეითერების მნიშვნელობა" || val === "ვის ეწოდება ჰეითერები" || val === "ვის ეწოდება ჰეითერები?"){ 
    response = `ჰეითერები (ინგლ. Haters) არის ინტერნეტმომხარებლები,
    იგივე გამომწერები, რომლებიც სოციალურ ქსელებში,
    აპლიკაციებში, ან ჩატში ტოვებენ ნეგატიურ
    კომენტარებს გარკვეული თემების 
    ან სხვა მომხმარებლების წინააღმდეგ.`
  }else if (val === "რა არის დიფამაცია" || val === "რა არის დიფამაცია?" || val === "დიფამაცია?" || val === "დიფამაცია" || val === "დიფამაცია." || val === "ვინ არის დიფამაცია?" || val === "ვინ არის დიფამაცია" || val === "დიფამაცია არის ვინ?" || val === "დიფამაცია არის ვინ" || val === "დიფამაცია არის ვინ." || val === "რას ნიშნავს დიფამაცია?" || val === "რას ნიშნავს დიფამაცია." || val === "რას ნიშნავს დიფამაცია" ||  val === "დიფამაციის მნიშვნელობა." || val === "დიფამაციის მნიშვნელობა" || val === "ვის ეწოდება დიფამაცია" || val === "ვის ეწოდება დიფამაცია?"){ 
    response = `დიფამაცია (ინგლ. Denigration) არის პირის შესახებ უცენზურო,
    სასტიკი ან ცრუ ინფორმაციის გავრცელება-გამოქვეყნება.`
  }else if (val === "რა არის ბულერი" || val === "რა არის ბულერი?" || val === "ბულერი?" || val === "ბულერი" || val === "ბულერი." || val === "ვინ არის ბულერი?" || val === "ვინ არის ბულერი" || val === "ბულერი არის ვინ?" || val === "ბულერი არის ვინ" || val === "ბულერი არის ვინ." || val === "რას ნიშნავს ბულერი?" || val === "რას ნიშნავს ბულერი." || val === "რას ნიშნავს ბულერი" ||  val === "ბულერის მნიშვნელობა." || val === "ბულერის მნიშვნელობა" || val === "ვის ეწოდება ბულერი" || val === "ვის ეწოდება ბულერი?"){
    response = `პირი, რომელიც ახორციელებს ბულინგს,
    დაშინებას ან დამცირებას..`
  }else if (val === "რა გავაკეთოთ ბულინგის შემთხვევაში" || val === "რა გავაკეთოთ ბულინგის შემთხვევაში?" || val === "რა გავაკეთოთ ბულინგის შემთხვევაში." || val === "რა მოვიმექმოდოთ ბულინგის შემთხვევაში" || val === "რა მოვიმექმოდოთ ბულინგის შემთხვევაში." || val === "რა მოვიმექმოდოთ ბულინგის შემთხვევაში?" || val === "როგორ მოვიქცეთ ბულინგის შემთხვევაში" || val === "როგორ მოვიქცეთ ბულინგის შემთხვევაში?" || val === "როგორ მოვიქცეთ ბულინგის შემთხვევაში." || val === "როგორ გავუმკლავდეთ ბულინგს." || val === "როგორ გავუმკლავდეთ ბულინგს?" || val === "როგორ გავუმკლავდეთ ბულინგს" || val === "ბულინგთან გამკვლავება" ||  val === "ბულინგთან გამკვლავება." || val === "როგორ დავაღწიოთ თავი ბულინგს" || val === "როგორ დავაღწიოთ თავი ბულინგს?" || val === "როგორ დავაღწიოთ თავი ბულინგს."){ 
    response = `ნებისმიერი პირი ვალდებულია მოსწავლის მიერ ან მოსწავლის მიმართ ბულინგის ან?
    კიბერბულინგის ჩადენის ფაქტის ცოდნის შემთხვევაში, აღნიშნულის შესახებ ინფორმაცია მიაწოდოს 
    მანდატურს,უფლებამოსილ პირს ან სკოლის ადმინისტრაციას.`
  }else if (val === "რა გავაკეთოთ კიბერბულინგის შემთხვევაში" || val === "რა გავაკეთოთ კიბერბულინგის შემთხვევაში?" || val === "რა გავაკეთოთ კიბერბულინგის შემთხვევაში." || val === "რა მოვიმექმოდოთ კიბერბულინგის შემთხვევაში" || val === "რა მოვიმექმოდოთ კიბერბულინგის შემთხვევაში." || val === "რა მოვიმექმოდოთ კიბერბულინგის შემთხვევაში?" || val === "როგორ მოვიქცეთ კიბერბულინგის შემთხვევაში" || val === "როგორ მოვიქცეთ კიბერბულინგის შემთხვევაში?" || val === "როგორ მოვიქცეთ კიბერბულინგის შემთხვევაში." || val === "როგორ გავუმკლავდეთ კიბერბულინგს." || val === "როგორ გავუმკლავდეთ კიბერბულინგს?" || val === "როგორ გავუმკლავდეთ კიბერბულინგს" || val === "კიბერბულინგთან გამკვლავება" ||  val === "კიბერბულინგთან გამკვლავება." || val === "როგორ დავაღწიოთ თავი კიბერბულინგს" || val === "როგორ დავაღწიოთ თავი კიბერბულინგს?" || val === "როგორ დავაღწიოთ თავი კიბერბულინგს." || val === "რითი ისჯება კიბერბულინგი."|| val === "რითი ისჯება კიბერბულინგი"|| val === "რითი ისჯება კიბერბულინგი?"){ 
    response = `<p>თუ მოსწავლის მიმართ ბულინგი ან 
    კიბერბულინგი შეიცავს დანაშაულის ნიშნებს,
    მანდატური,უფლებამოსილი პირი ან სკოლის ადმინისტრაცია დაუყოვნებლივ უნდა დაიკავშირდეს „112“-ს.</p>
    
    <p>ისინი ვალდებული არიან დაადგინონ
    ბულინგის/კიბერბულინგის მიზეზები, გაესაუბრონ ყველა ჩართულ მხარეს, დაადგინონ წინააღმდეგობები მონაყოლებს
    შორის და შეიმუშაონ პრობლემის მოგვარების გზები.</p>`
  }else if (val === "რა გავაკეთოთ კიბერბულინგის თავიდან ასაცილებლად" || val === "რა გავაკეთოთ კიბერბულინგის თავიდან ასაცილებლად?" || val === "რა გავაკეთოთ კიბერბულინგის თავიდან ასაცილებლად." || val === "რა მოვიმექმოდოთ კიბერბულინგის თავიდან ასაცილებლად" || val === "რა მოვიმექმოდოთ კიბერბულინგის თავიდან ასაცილებლად." || val === "რა მოვიმექმოდოთ კიბერბულინგის თავიდან ასაცილებლად?" || val === "როგორ მოვიქცეთ კიბერბულინგის თავიდან ასაცილებლად" || val === "როგორ მოვიქცეთ კიბერბულინგის თავიდან ასაცილებლად?" || val === "როგორ მოვიქცეთ კიბერბულინგის თავიდან ასაცილებლად." || val === "როგორ გავუმკლავდეთ თავიდან ასაცილებლად." || val === "როგორ გავუმკლავდეთ თავიდან ასაცილებლად?" || val === "კიბერბულინგის თავიდან ასაცილებლად" ||  val === "კიბერბულინგის თავიდან ასაცილებლად."){ 
    response = `კიბერბულინგის პროვენციისთვის საჭიროა:
    
    <p>1. მოსწავლეებს შეეძლოთ კიბერბულინგის იდენტიფიცირება.</p>
    <p>2. სასკოლო წესები შექმნა კიბერბულინგთან ბრძოლის კუთხით.</p>
    <p>3. მოსწავლეებს საშუალება უნდა ჰქონდეთ აქტიურად ჩაერთონ კიბერბულინგთან ბრძოლოს სასკოლო წესების შემუშავება-დამკვიდრებაში.</p>
    <p>4. მოსწავლები უნდა იყვნენ გაცნობილნი კიბერბულინზე რეაგირების საკანონმდებლო რეგულაციებზე.</p>
    <p>5. მოსწავლეები შემოქმედებითად უნდა მოეკიდნონ კიბერბულინგის თემატიკას (მაგალითად საკლასო და კლასგარეშე აქტივობები ამ თემის ირგვლივ).</p>
    <p>6. მოწვეულნი უნდა იქნან ექსპერტები, სამთავრობო და არასამთავრობო ორგანიზაციები მოსწავლეებთან შეხვედრაზე კიბერბულინგის თემაზე სასაუბროდ.</p>`
  }else if (val === "როგორ დავიცვათ თავი ფიშინგისგან?" || val === "როგორ დავიცვათ თავი ფიშინგისგან" || val === "როგორ დავიცვათ თავი ფიშინგისგან." || val === "ფიშინგისგან თავის დაცვის გზები" || val === "ფიშინგისგან თავის დაცვის გზები." || val === "ფიშინგისგან თავის დაცვის გზები?" || val === "ფიშინგისგან დავის დაცვა" || val === "ფიშინგისგან დავის დაცვა?" || val === "ფიშინგისგან დავის დაცვა." || val === "თავის დაცვა ფიშინგისგან." || val === "თავის დაცვა ფიშინგისგან" || val === "როგორ გავუმკლავდეთ ფიშინგს?" ||  val === "როგორ გავუმკლავდეთ ფიშინგს"){ 
    response = `ფიშინგისგან თავის დასაცავად საჭიროა იყო ყურადღებით ყოველდღიური ინტერნეტის მოხმარების დროს

    <p>1.არ დააკლიკო თქვენთვის უცნობი ელ-ფოსტის შეტყობინებაში მითითებულ ბმულებს და არ გახსნა მიმაგრებული დანართები</p>

    <p>2.არავის გაუზიარო პერსონალური ან/და ფინანსური ინფორმაცია</p>

    <p>3.რეგულარულად განაახლე ბრაუზერები რომლებსაც იყენებთ</p>

    <p>4.არ შეიყვანო პირადი ინფორმაცია საეჭვო ვებ-გვერდებზე სანამ არ დარწმუნდები მის სანდოობაში</p>

    <p>5.გაითვალისწინე, რომ დაცულ გვერდს საძიებო ველის მარცხენა მხარეს აქვს ბოქლომის ნიშანი და იწყება https://-ით;
    მიიტანეთ მაუსის კურსორი ბმულთან, რაც მოგცემთ საშუალებას ნათლად დაინახოთ რეალური ბმული;</p>

    <p>6.არ უპასუხო სპამ წერილებს, ამით შენ ადასტურებ, რომ ელ-ფოსტის მისამართი აქტიურია და ამის შემდეგ უფრო მეტ სპამს მიიღებ</p>`
  }                                


  function Ioado(keyname, moname) {

   // console.log(moname);

    if(keyname === "Enter" && val !== ""){
      let botpic = document.createElement("div");
      botpic.setAttribute("id", "botpic");

      let userpic = document.createElement("div");
      userpic.setAttribute("id", "userpic");


      let bs = document.createElement("p");
      bs.setAttribute("id", "noba");
      bs.innerText = val.toString(); //"rgrg";
      

      let ns = document.createElement("p");
      ns.setAttribute("id", "coba");
      ns.innerHTML = response;
      
      bs.style = `top: ${bs.offsetHeight + io}px;`;
      botpic.style = `top: ${bs.offsetHeight + io}px;`;
      


      document.getElementById('chatscroll').appendChild(botpic);
      document.getElementById('chatscroll').appendChild(bs);// = grg;

      ns.style = `top: ${ns.offsetHeight + io}px;`;
      userpic.style = `top: ${ns.offsetHeight + io}px;`;

      
      
      document.getElementById('chatscroll').appendChild(ns);
      document.getElementById('chatscroll').appendChild(userpic);


      document.getElementById('inputline').value = "";
      val = "";

      const scrollToBottom = (id) => {
        
        const element = document.getElementById(id);
        element.scrollTop = element.scrollHeight;
    }
    scrollToBottom("chatscroll");

      io = io + ns.offsetHeight + 150;
    }
  }
  
  return (
    <>
    <div id='mainchat'>

    <div id='chatscroll'>

      <img id='cocopic' src={ require('./botprofile.png')} alt='robohello'></img>
      <div id='cocotext'>
        <>გამარჯობა!</>
        <hr />
        <p>მე მქვია კოკო.</p>
        <p>მე მოგაწვდით ინფორმაციას ინტერნეტში არსებული საფრთხეებისგან თავის დაცვის შესახებ.</p>
        <p>ჩაწერეთ კითხვა ქვემოთ მოცემულ ველში.</p>
      </div>
    
    </div>
   
    <div id='write'>
      
      <img src={ require('./search_icon_1.png')} alt="inputpic" id="inputpic"></img>
      <input type='text' id='inputline' placholder='rf!' onKeyPress={(e: KeyboardEvent<HTMLDivElement>) => Ioado(e.key, "gr")} onChange={handleChange} value={message} ></input>     
    </div>
      
      
      
    </div>
    </>
  );
}

export default App;
